In [2]:
# Series is NumPy array with index by label

In [3]:
import numpy as np

In [10]:
import pandas as pd

In [ ]:
# 4 python objects: labels list, my_data list, np array(python list), d dictionary

In [5]:
labels = ['a', 'b', 'c']

In [7]:
my_data = [10, 20, 30]

In [8]:
arr = np.array(my_data)

In [9]:
d = {'a':10, 'b':20, 'c': 30}

In [11]:
# series creation

In [12]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [13]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [17]:
# pd.Series can put any objects inside, unlike NumPy arrays

In [18]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [20]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany', 'USSR', 'Japan'])

In [21]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [22]:
ser2 = pd.Series([1,2,5,4],['USA', 'Germany', 'Italy', 'Japan'])

In [23]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [24]:
ser1['USA']

1

In [25]:
ser3 = pd.Series(labels)

In [26]:
ser3

0    a
1    b
2    c
dtype: object

In [27]:
ser3[0]

'a'

In [28]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [29]:
# Pandas NumPy always convert integer to float to keep all info and not missing things

In [30]:
# Data Frames

In [35]:
from numpy.random import randn

In [ ]:
# set seed number to have 'pseudo-random', a random values the same for everybody using the same seed

In [32]:
np.random.seed(101)

In [33]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [37]:
# each column is a Series

In [38]:
type(df)

pandas.core.frame.DataFrame

In [39]:
type(df['W'])

pandas.core.series.Series

In [41]:
# DataFrame is just a bunch of series (in multiple columns) that shares the same index A,B,C,D,E

In [46]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [ ]:
# 1 column in a DataFrame is a Series, multiple column in a DataFrame is a DataFrame

In [45]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [47]:
# DataFrame new column, drop column (axis = 1 horizontal) axis = 0 is vertical, by default, axis = 0

In [48]:
df['NEW'] = df['W'] + df['Y']

In [49]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [50]:
df.drop('NEW', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [52]:
df.drop('NEW', axis=1, inplace=True)

In [53]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df.drop('E', axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df.shape

(5, 4)

In [59]:
# (5, 4) tuple, 5 is at axis = 0 (rows), 4 is at axis = 1 (columns). shape is NumPy Array, axis came from NumPy Array

In [62]:
# select column is df.['W'], select row is below, also returns a Series, so both column and rows returns Series

In [61]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [63]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [64]:
df.loc['B','Y']

-0.8480769834036315

In [65]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077